In [70]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [76]:
data = [4, 8, 15, 23, 42]
df = pd.Series(data)

print(df)

0     4
1     8
2    15
3    23
4    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [77]:
container  = [1, 23, 4.5, "Hello There", "How is your Mode", "Love Data", True, [1,2], "yes", "Email_id"]
df1 = pd.Series(container)
print(df1)

0                   1
1                  23
2                 4.5
3         Hello There
4    How is your Mode
5           Love Data
6                True
7              [1, 2]
8                 yes
9            Email_id
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

In [81]:
data_from_table = {
    "Name" : ["Alice", "Bob", "Claire"],
    "Age" : [25, 30, 27],
    "Gender" : ["Female", "Male", "Female"]
}


df2 = pd.DataFrame(data_from_table)
print(df2)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [82]:
type(df2)

pandas.core.frame.DataFrame

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [99]:
# DataFrame hold a 2-dimensional labeld data while a Series hold only one-dimensional labeld Data
#For example if we add two series we have at the end one data frame


data_series = [1, 2, 3, 4]
df_serie = pd.Series(data_series)

data_Frame = {
    "id" : [123, 345, 567],
    "name" : ["abdullah", "reslan", "magdeburg"],
    
}
df_Frame = pd.DataFrame(data_Frame)

print(df_serie)
print("="*50)
print(df_Frame)

0    1
1    2
2    3
3    4
dtype: int64
==================================================
    id       name
0  123   abdullah
1  345     reslan
2  567  magdeburg

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [100]:
"""
for example we have : head(), tail(), info(), describe() 
"""
df_Frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      3 non-null      int64
 1   name    3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [108]:
#Therefore, Series and DataFrame are mutable in nature, while Panel is no longer applicable for use as it has been deprecated.

Create a DataFrame using multiple Series. Explain with an example.

In [114]:
serie1 = [1,2,3,4]
serie2 = ["name", "school", "subject", "teacher"]
s1 = pd.Series(serie1)
s2 = pd.Series(serie2)

pd.concat([s1,s2], axis=1)

   0        1
0  1     name
1  2   school
2  3  subject
3  4  teacher

In [117]:
# or using the data frame function

pd.DataFrame([s1,s2]).T

   0        1
0  1     name
1  2   school
2  3  subject
3  4  teacher

In [118]:
pd.DataFrame({"serie1":s1, "serie2":s2})

   serie1   serie2
0       1     name
1       2   school
2       3  subject
3       4  teacher